tap "felixkratz/formulae"
# tap "nikitabobko/tap"   # disabled while dogfooding the bsp fork build (see aerospace-bsp below)
tap "pszypowicz/tap"
tap "warrensbox/tap"
brew "bat"
brew "betterleaks"
brew "cloudflare-wrangler"
brew "colima", start_service: true
brew "container"
brew "coreutils"
brew "curl"
brew "devcontainer"
brew "dfu-util"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-credential-helper"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "glow"
brew "gnupg"
brew "go"
brew "graphviz"
brew "htop"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lsd"
brew "magic-wormhole.rs"
brew "markdownlint-cli2"
brew "mermaid-cli"
brew "mosquitto"
brew "node@20"
brew "openjdk"
brew "openjdk@21"
brew "pam-reattach"
brew "poppler"
brew "pre-commit"
brew "prettier"
brew "pstree"
brew "pyright"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stow"
brew "swiftly"
brew "switchaudio-osx"
brew "tmux"
brew "uv"
brew "watch"
brew "wget"
brew "xcodegen"
brew "yamllint"
brew "yt-dlp"
brew "zoxide"
brew "felixkratz/formulae/sketchybar", trusted: true
brew "pszypowicz/tap/afm-summarize", trusted: true
# cask "nikitabobko/tap/aerospace", trusted: true   # disabled while dogfooding the bsp fork build below
cask "pszypowicz/tap/aerospace-bsp", trusted: true
cask "anki"
cask "calibre"
cask "copilot-cli"
cask "font-caskaydia-cove-nerd-font"
cask "pszypowicz/tap/mic-guard", trusted: true
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "menuwhere"
cask "microsoft-teams"
cask "obsidian"
cask "secretive"
cask "sf-symbols"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"
cask "warrensbox/tap/tfswitch", trusted: true
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "golang.org/x/vuln/cmd/govulncheck"
go "honnef.co/go/tools/cmd/staticcheck"
