tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "pszypowicz/tap"
tap "warrensbox/tap"
brew "bat"
brew "cloudflare-wrangler"
brew "container"
brew "coreutils"
brew "curl"
brew "dfu-util"
brew "direnv"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "go"
brew "graphviz"
brew "htop"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lsd"
brew "magic-wormhole.rs"
brew "mermaid-cli"
brew "mosquitto"
brew "openjdk@21"
brew "p7zip"
brew "pam-reattach"
brew "pre-commit"
brew "prettier"
brew "pstree"
brew "pyright"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stow"
brew "swiftly"
brew "switchaudio-osx"
brew "tmux"
brew "uv"
brew "watch"
brew "wget"
brew "xcodegen"
brew "yt-dlp"
brew "zoxide"
brew "felixkratz/formulae/sketchybar"
# cask "nikitabobko/tap/aerospace"   # disabled while dogfooding the bsp fork build below
cask "pszypowicz/tap/aerospace-bsp"
cask "alt-tab"
cask "anki"
cask "calibre"
cask "chatgpt"
cask "copilot-cli"
cask "deepl"
cask "dotnet-sdk"
cask "drawio"
cask "font-caskaydia-cove-nerd-font"
cask "pszypowicz/tap/mic-guard"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "menuwhere"
cask "microsoft-teams"
cask "obsidian"
cask "secretive"
cask "sf-symbols"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"
cask "warrensbox/tap/tfswitch"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "golang.org/x/vuln/cmd/govulncheck"
go "honnef.co/go/tools/cmd/staticcheck"
