tap "felixkratz/formulae"
tap "nikitabobko/tap"
brew "bat"
brew "container"
brew "coreutils"
brew "dfu-util"
brew "direnv"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lsd"
brew "magic-wormhole.rs"
brew "mermaid-cli"
brew "mosquitto"
brew "p7zip"
brew "pam-reattach"
brew "pstree"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "tmux"
brew "uv"
brew "watch"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "nikitabobko/tap/aerospace"
cask "alt-tab"
cask "android-platform-tools"
cask "android-studio"
cask "anki"
cask "audacity"
cask "blackhole-2ch"
cask "calibre"
cask "chatgpt"
cask "copilot-cli"
cask "deepl"
cask "docker-desktop"
cask "dotnet-sdk"
cask "drawio"
cask "font-caskaydia-cove-nerd-font"
cask "github-copilot-for-xcode"
cask "google-chrome"
cask "librewolf"
cask "menuwhere"
cask "microsoft-teams"
cask "obsidian"
cask "secretive"
cask "sf-symbols"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Work-specific packages — update hostname to match your work machine
if `hostname`.strip == "WORK_HOSTNAME_PLACEHOLDER"
  tap "azure/kubelogin"
  tap "warrensbox/tap"
  brew "azure-cli"
  brew "azure/kubelogin/kubelogin"
  brew "k9s"
  brew "sshuttle"
  brew "terraform-docs"
  brew "tflint"
  brew "trivy"
  brew "warrensbox/tap/tfswitch"
  cask "1password"
  cask "1password-cli"
end
